#ifndef _NTCthermistor_h_
#define _NTCthermistor_h_

/*===========================================================================*/
#ifdef __cplusplus  /* C++支持 */
	extern "C"{
#endif

#include "pcf8591.h"
#include "stdint.h"

/********************************************************
*函数名称：int8_t getTemperature(void)
*功能：测算出当前热敏电阻检测到的温度
*输入：无
*输出：输出温度值，有符号，单位：℃
*特殊说明：度范围-20℃~120℃
**********************************************************/
int8_t getTemperature(uint8_t ch);

/*===========================================================================*/
#ifdef __cplusplus  /* C++支持 */
	}
#endif
/*===========================================================================*/

#endif  /* _NTCthermistor_h_ */

