/******************************************************************************
* @ File name --> usart.h
* @ Author    --> By@ Sam Chan
* @ Version   --> V1.0
* @ Date      --> 10 - 20 - 2012
* @ Brief     --> 系统串口设置相关的函数
*
* @ Copyright (C) 20**
* @ All rights reserved
*******************************************************************************
*
*                                  File Update
* @ Version   --> V1.0.1
* @ Author    --> By@ Sam Chan
* @ Date      --> 05 - 10 - 2014
* @ Revise    --> 增加对C++环境支持
*
******************************************************************************/

#ifndef _hal_usart1_h_
#define _hal_usart1_h_

/*===========================================================================*/
#ifdef __cplusplus  /* C++支持 */
	extern "C"{
#endif
/*===========================================================================*/

/******************************************************************************
                               外部函数头文件                        
******************************************************************************/

#include <stdio.h>	//printf函数头文件

#include "sys.h" 

/******************************************************************************
                               定义相关应用项
******************************************************************************/

#define USART1_REC_LEN					255	//定义最大接收字节数
#define EN_USART1_RX					0	//串口接收使能。
										//1：允许接收
										//0：禁止接收

/******************************************************************************
                              外部调用功能函数
******************************************************************************/

#if EN_USART1_RX	//使能了串口接收

	extern uint8_t  USART1_RX_BUF[USART1_REC_LEN];	//接收缓冲，最大USART_REC_LEN个字节，末字节为换行符 
	extern uint16_t USART1_RX_COUNT;					//usart1接收到数据个数
	extern uint8_t F_USART1_RX_FINISH;//接收状态标记,1:usart1接收完成，0：usart1接收未完成
	extern uint8_t F_USART1_RX_RECEIVING;//串口接收正在进行中标记,1:进行中，0：暂停或结束
	extern uint8_t USART1_RX_TIMEOUT_COUNT;	//串口接收超时计数。串口超过3ms未接收到数据，视为超时。单位：ms

#endif

void USART1_Init(uint32_t bound);	//初始化IO 串口1
void USART1_SendData(uint16_t Data);
void USART1_SendStr(uint8_t *Data);

/*===========================================================================*/
#ifdef __cplusplus  /* C++支持 */
	}
#endif
/*===========================================================================*/


#endif  /* enf usart.h */





